////////////////////////////////////////////////////////////////////////////////
// 
//  University of Illinois/NCSA Open Source License
//  http://otm.illinois.edu/disclose-protect/illinois-open-source-license
//  
//  Parfu is copyright © 2017, The Trustees of the University of Illinois. 
//  All rights reserved.
//  
//  Parfu was developed by:
//  The University of Illinois
//  The National Center For Supercomputing Applications (NCSA)
//  Blue Waters Science and Engineering Applications Support Team (SEAS)
//  Craig P Steffen <csteffen@ncsa.illinois.edu>
//  
//  https://github.com/ncsa/parfu_archive_tool
//  http://www.ncsa.illinois.edu/People/csteffen/parfu/
//  
//  For full licnse text see the LICENSE file provided with the source
//  distribution.
//  
////////////////////////////////////////////////////////////////////////////////

#include <parfu_primary.h>
#include <time.h>

// TODO: make tarenty usable for this.
// tar header
struct ustar_hdr {
  char name[100];      /*   0 */
  char mode[8];        /* 100 */
  char uid[8];         /* 108 */
  char gid[8];         /* 116 */
  char size[12];       /* 124 */
  char mtime[12];      /* 136 */
  char chksum[8];      /* 148 */
  char typeflag;       /* 156 */
  char linkname[100];  /* 157 */
  char magic[6];       /* 257 */
  char version[2];     /* 263 */
  char uname[32];      /* 265 */
  char gname[32];      /* 297 */
  char devmajor[8];    /* 329 */
  char devminor[8];    /* 337 */
  char prefix[155];    /* 345 */ /* not used in pax format */
  char pad[12];        /* 500 */
};

  // this is the catalog header; it's very important to leave the formatting alone
  // it must match the later re-writing

  // catalog header:
  // each of the initial header numbers is a 10-digit number delineated 
  // by an '\n' at the end

  // all numbers or quantities in the catalog head or catalog are written 
  // out in ASCII.  This makes it human readable, among other things.
  // \n is a newline (single byte)
  // \t is a tab character (single byte)
  // which characters are actually used as the value delimeters can
  // be set in the parfu header file with #define statements

  // There are two options here.  One is a catalog that's sent between ranks
  // as a buffer.  This is a "full" catalog.  The other is an "archive" 
  // catalog, which leaves out some information that's in the full catalog.

  // catalog header (full):
  // SSSSSSSSSS\n  total size of catalog, in bytes, including whole header
  // parfu_v04 \n  version string
